Repository: glekner/next-js-lingui-starter
Catalog: src/locales/*/messages.po
Languages: es, fr

source: Features
es: Características
fr: Fonctionnalités

source: Getting Started
es: Comenzando
fr: Commencer

source: Hello World
es: Hola Mundo
fr: Bonjour le Monde

source: Lingui i18n with SSR support
es: Lingui i18n con soporte SSR
fr: Lingui i18n avec support SSR

source: Multiple locale support (EN, ES, FR)
es: Soporte de múltiples idiomas (EN, ES, FR)
fr: Support de plusieurs langues (EN, ES, FR)

source: Run `npm run lingui:compile` to compile translations
es: Ejecuta `npm run lingui:compile` para compilar traducciones
fr: Exécutez `npm run lingui:compile` pour compiler les traductions

source: Run `npm run lingui:extract` to extract messages
es: Ejecuta `npm run lingui:extract` para extraer mensajes
fr: Exécutez `npm run lingui:extract` pour extraire les messages

source: Switch languages using the buttons above
es: Cambia de idioma usando los botones de arriba
fr: Changez de langue en utilisant les boutons ci-dessus

source: This is a starter template with server-side rendering support for internationalization.
es: Esta es una plantilla inicial con soporte de renderizado del lado del servidor para internacionalización.
fr: Ceci est un modèle de démarrage avec support de rendu côté serveur pour l'internationalisation.

source: Translate messages in src/locales/*/messages.po
es: Traduce mensajes en src/locales/*/messages.po
fr: Traduisez les messages dans src/locales/*/messages.po

source: Turbopack with .po file loader
es: Turbopack con cargador de archivos .po
fr: Turbopack avec chargeur de fichiers .po

source: TypeScript configuration
es: Configuración de TypeScript
fr: Configuration TypeScript

source: Welcome to Next.js 16 with Lingui i18n!
es: ¡Bienvenido a Next.js 16 con Lingui i18n!
fr: Bienvenue à Next.js 16 avec Lingui i18n!
